In [ ]:
# Задание №1 .Скачайте с сайта https://grouplens.org/datasets/movielens/ датасет любого размера. 
#Определите какому фильму было выставлено больше всего оценок 5.0

In [1]:
import pandas as pd

In [2]:
data = pd.read_csv('ratings.csv')
data.head()

   userId  movieId  rating   timestamp
0       1      296     5.0  1147880044
1       1      306     3.5  1147868817
2       1      307     5.0  1147868828
3       1      665     5.0  1147878820
4       1      899     3.5  1147868510

In [3]:
max_data = data[data.rating == 5.0]['movieId'].value_counts().head(1)
max_data

318    39553
Name: movieId, dtype: int64

In [4]:
max_data.iloc[0]

39553

In [5]:
data = pd.read_csv('movies.csv')
data.head(5)

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy

In [6]:
data.filter(items = ['movieId', 'title'])

       movieId                               title
0            1                    Toy Story (1995)
1            2                      Jumanji (1995)
2            3             Grumpier Old Men (1995)
3            4            Waiting to Exhale (1995)
4            5  Father of the Bride Part II (1995)
...        ...                                 ...
62418   209157                           We (2018)
62419   209159           Window of the Soul (2001)
62420   209163                    Bad Poems (2018)
62421   209169                 A Girl Thing (2001)
62422   209171      Women of Devil's Island (1962)

[62423 rows x 2 columns]

In [7]:
df = pd.DataFrame(data)
df

,movieId,title,genres
0,1,Toy Story (1995),Adventure|Animation|Children|Comedy|Fantasy
1,2,Jumanji (1995),Adventure|Children|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama|Romance
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
62418,209157,We (2018),Drama
62419,209159,Window of the Soul (2001),Documentary
62420,209163,Bad Poems (2018),Comedy|Drama
62421,209169,A Girl Thing (2001),(no genres listed)
62422,209171,Women of Devil's Island (1962),Action|Adventure|Drama

In [8]:
type(df.iloc[0])

pandas.core.series.Series

In [9]:
df.loc[df['movieId'] == 318]

     movieId                             title       genres
314      318  Shawshank Redemption, The (1994)  Crime|Drama

In [10]:
df.iloc[314]

movieId                                 318
title      Shawshank Redemption, The (1994)
genres                          Crime|Drama
Name: 314, dtype: object

In [ ]:
#Задание №2. По данным файла power.csv посчитайте суммарное потребление стран Прибалтики (Латвия, Литва и Эстония) 
#категорий 4, 12 и 21 за период с 2005 по 2010 года. 
#Не учитывайте в расчетах отрицательные значения quantity

In [13]:
data = pd.read_csv('power.csv')
data.head()

   country  year  quantity  category
0  Austria  1996       5.0         1
1  Austria  1995      17.0         1
2  Belgium  2014       0.0         1
3  Belgium  2013       0.0         1
4  Belgium  2012      35.0         1

In [15]:
filtered_countries = data[(data['country'].isin(['Lithuania','Latvia', 'Estonia'])) & (data['category'].isin(['4','12','21'])) & (data['year'].isin(['2005','2006','2007','2008','2009','2010'])) & (data['quantity'] >=0)]
filtered_countries.head(10)

         country  year  quantity  category
10617    Estonia  2008       1.0         4
10618    Estonia  2007       0.0         4
10619    Estonia  2006       0.0         4
10620    Estonia  2005       1.0         4
11156  Lithuania  2008       1.0         4
11157  Lithuania  2007       0.0         4
11158  Lithuania  2006       1.0         4
11159  Lithuania  2005       1.0         4
12755    Estonia  2008       1.0         4
12756    Estonia  2007       0.0         4

In [16]:
filtered_countries['country'].unique()

array(['Estonia', 'Lithuania', 'Latvia'], dtype=object)

In [17]:
filtered_countries['year'].unique()

array([2008, 2007, 2006, 2005, 2010, 2009], dtype=int64)

In [18]:
filtered_countries['category'].unique()

array([ 4, 12, 21], dtype=int64)

In [21]:
filtered_countries['quantity'].sum()

240580.0

In [ ]:
#Задание №3.Выберите страницу любого сайта с табличными данными. Импортируйте таблицы в pandas dataframe.
#Примеры страниц (необязательно брать именно эти): 
#https://fortrader.org/quotes
#https://www.finanz.ru/valyuty/v-realnom-vremeni

In [19]:
pd.read_html('https://www.finanz.ru')[0]

,0,1,2,3,4,5,6,7,8,9,10,11
0,аааа,2Т 952,"-0,7%",Nasdaq,10Т 793,"-1,1%",ааИбаКаОаЙаН,10Т 982,"0,4%",USD/RUB,756995,"0,1%"
1,а аЂаЁ,1Т 229,"-1,2%",S&P500,3Т 319,"-1,1%",ааЕббб,430,"-0,5%",EUR/RUB,896770,"0,8%"
2,Dow,27Т 657,"-0,9%",FTSE100,6Т 007,"-0,7%",ааОаЛаОбаО,1Т 951,"0,3%",EUR/USD,11840,"0,0%"

In [20]:
page_url = 'https://www.finanz.ru/valyuty/usd-rub'
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

In [21]:
df[0]

       Дата  Закрытие  Открытие  Максимум  Минимум
0  18.09.20    756502    751236    757755   748595
1  17.09.20    751237    749084    754510   748668
2  16.09.20    749083    750900    754345   746570
3  15.09.20    750901    753332    753755   746975
4  14.09.20    753333    749345    755296   745730
5  13.09.20    749355    750030    750495   749345
6  11.09.20    750120    751475    753150   747490
7  10.09.20    751915    753612    756810   746680
8  09.09.20    753613    762907    764780   752035

In [22]:
page_url = 'https://www.finanz.ru/valyuty/v-realnom-vremeni-rub'
df = pd.read_html(page_url, attrs = {'class': 'news_table'}, encoding='utf-8')

ValueError: No tables found

In [ ]:
df[0]